Tekla.Structures.Model.RebarSpacing.StartOffsetType
Gets or sets a value indicating whether the start offset is exact or minimum.
If the start offset is minimum the spacing algorithm may determine a larger offset.

Tekla.Structures.Model.RebarSpacing.EndOffsetType
Gets or sets a value indicating whether the end offset is exact or minimum.
If the end offset is minimum the spacing algorithm may determine a larger offset.